Extensions/нп_КонтрольПроведенияПоДО/src/InformationRegisters/нп_НастройкиКонтроляПроведенияПоДО/нп_НастройкиКонтроляПроведенияПоДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>нп_НастройкиКонтроляПроведенияПоДО</name>
  <dimensions>
    <name>ПолноеИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <resources>
    <name>КонтролироватьПроведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Extensions/нп_КонтрольПроведенияПоДО/src/CommonModules/нп_КонтрольПроведенияПоСогласованиюДОПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает настройку контроля по типу документа и организации (кэш на время сеанса).
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных.
//  Организация - СправочникСсылка.Организации - организация.
//
// Возвращаемое значение:
//  Структура, Неопределено
//
Функция НастройкаКонтроля(ПолноеИмя, Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(ПолноеИмя) Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Настройки.ПолноеИмяОбъектаМетаданных КАК ПолноеИмяОбъектаМетаданных,
		|	Настройки.Организация КАК Организация,
		|	Настройки.КонтролироватьПроведение КАК КонтролироватьПроведение
		|ИЗ
		|	РегистрСведений.нп_НастройкиКонтроляПроведенияПоДО КАК Настройки
		|ГДЕ
		|	Настройки.ПолноеИмяОбъектаМетаданных = &ПолноеИмя
		|	И Настройки.Организация = &Организация");
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПолноеИмяОбъектаМетаданных", Выборка.ПолноеИмяОбъектаМетаданных);
	Результат.Вставить("Организация", Выборка.Организация);
	Результат.Вставить("КонтролироватьПроведение", Выборка.КонтролироватьПроведение);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
